ChristianMarty/RoomBus/uc/uCodebase/common/io_same51jx.h
/*
 * BUS-Controller2.h
 *
 * Created: 15.02.2019 00:01:24
 *  Author: Christian
 */ 


#ifndef BUS_CONTROLLER2_IO_H_
#define BUS_CONTROLLER2_IO_H_

#include "sam.h"
#include "driver/SAMx5x/pin.h"
#include <stdbool.h>

#ifdef __cplusplus
extern "C" {
#endif

#define IO_A00 PIN_PORT_A,02
#define IO_A01 PIN_PORT_A,03
#define IO_A02 PIN_PORT_A,04
#define IO_A03 PIN_PORT_A,05
#define IO_A04 PIN_PORT_A,06
#define IO_A05 PIN_PORT_A,07
#define IO_A06 PIN_PORT_B,07
#define IO_A07 PIN_PORT_B,06
#define IO_A08 PIN_PORT_B,05
#define IO_A09 PIN_PORT_B,04
#define IO_A10 PIN_PORT_B,02
#define IO_A11 PIN_PORT_B,03
#define IO_A12 PIN_PORT_B,00
#define IO_A13 PIN_PORT_B,01

#define IO_D00 PIN_PORT_B,12
#define IO_D01 PIN_PORT_B,13
#define IO_D02 PIN_PORT_B,14
#define IO_D03 PIN_PORT_B,15
#define IO_D04 PIN_PORT_A,12
#define IO_D05 PIN_PORT_A,13
#define IO_D06 PIN_PORT_A,14
#define IO_D07 PIN_PORT_A,15
#define IO_D08 PIN_PORT_A,16
#define IO_D09 PIN_PORT_A,17
#define IO_D10 PIN_PORT_A,18
#define IO_D11 PIN_PORT_A,19
#define IO_D12 PIN_PORT_B,16
#define IO_D13 PIN_PORT_B,17
#define IO_D14 PIN_PORT_A,20
#define IO_D15 PIN_PORT_A,21
#define IO_D16 PIN_PORT_B,31
#define IO_D17 PIN_PORT_B,30


#define EIC_D00 12 
#define EIC_D01 13
#define EIC_D02 14
#define EIC_D03 15
#define EIC_D04 12
#define EIC_D05 13
#define EIC_D06 14
#define EIC_D07 15
#define EIC_D08 00
#define EIC_D09 01
#define EIC_D10 02
#define EIC_D11 03
#define EIC_D12 00
#define EIC_D13 01
#define EIC_D14 04
#define EIC_D15 05
#define EIC_D16 15
#define EIC_D17 14

#define EIC_A00 02
#define EIC_A01 03
#define EIC_A02 04
#define EIC_A03 05
#define EIC_A04 06
#define EIC_A05 07
#define EIC_A06 07
#define EIC_A07 06
#define EIC_A08 05
#define EIC_A09 04
#define EIC_A10 02
#define EIC_A11 03
#define EIC_A12 00
#define EIC_A13 01


#ifdef __cplusplus
}
#endif
#endif /* BUS_CONTROLLER2_IO_H_ */